In [1]:
import numpy  as np
import pandas as pd

In [15]:
s = pd.DataFrame(np.random.randn(5,2), index=['a', 'b', 'c', 'd', 'e'])

In [16]:
s['Name'] = ['a,Mr. Pepe','b,Mr. Pipo','c,Mrs. Pepa','d,Don. Alberto','e,Master. Popo']

In [17]:
df_combo = s

In [18]:
df_combo

          0         1            Name
a  0.174591  0.401336      a,Mr. Pepe
b  0.128044  1.194202      b,Mr. Pipo
c  1.974901  0.652154     c,Mrs. Pepa
d  0.522482 -1.860607  d,Don. Alberto
e -0.308634  0.617819  e,Master. Popo

In [19]:
df_combo['Name'].str.split(',').str.get(1).str.split('.').str.get(0).unique()

array(['Mr', 'Mrs', 'Don', 'Master'], dtype=object)

In [20]:
my_dict = {}
for entry in df_combo['Name'].str.split(',').str.get(1).str.split('.').str.get(0).unique():
    print("entry:" + entry)
    my_dict[entry] = entry
my_dict

entry:Mr
entry:Mrs
entry:Don
entry:Master

{'Don': 'Don', 'Master': 'Master', 'Mr': 'Mr', 'Mrs': 'Mrs'}

In [21]:
my_dict = {'Don':     'Man', 
           'Master':  'Prof', 
           'Mr':      'Man', 
           'Mrs':     'Miss'
          }

In [22]:
my_dict

{'Don': 'Man', 'Master': 'Prof', 'Mr': 'Man', 'Mrs': 'Miss'}

In [30]:
df_combo['Title'] = df_combo['Name'].str.split(',').str.get(1).str.split('.').str.get(0)

In [31]:
df_combo

          0         1            Name   Title
a  0.174591  0.401336      a,Mr. Pepe      Mr
b  0.128044  1.194202      b,Mr. Pipo      Mr
c  1.974901  0.652154     c,Mrs. Pepa     Mrs
d  0.522482 -1.860607  d,Don. Alberto     Don
e -0.308634  0.617819  e,Master. Popo  Master

In [32]:
df_combo.replace({"Title": my_dict})

          0         1            Name Title
a  0.174591  0.401336      a,Mr. Pepe   Man
b  0.128044  1.194202      b,Mr. Pipo   Man
c  1.974901  0.652154     c,Mrs. Pepa  Miss
d  0.522482 -1.860607  d,Don. Alberto   Man
e -0.308634  0.617819  e,Master. Popo  Prof

In [28]:
del df_combo['Title']